Tekla Open API Reference for Tekla Structures 2025
LoadingForm Properties
The LoadingForm type exposes the following members.
Properties
Name | Description
AllowClosing
 Allows the closing of the dialog. By default disabled.
Top
See Also
Reference
LoadingForm Class
Tekla.Structures.Dialog.UIControls Namespace